app/controllers/comments_controller.rb

  def create
    commentable = find_commentable
    cont = params[:content]
    @comment = Comment.new(user_id: current_user.id, commentable_id: commentable.id, commentable_type: commentable.class.name ,content: cont, flagged: false)
    @comment.save
---
INSERT INTO "comments" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "un saludazo"], ["created_at", "2015-05-16 07:09:46.300662"], ["updated_at", "2015-05-16 07:09:46.300662"]]

  def destroy
    Comment.find(params[:id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 4]]