app/controllers/courses_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    school = School.find(params[:school_id])