app/controllers/professors_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    school = School.find(params[:school_id])

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @professor = Professor.find(params[:id])

DELETE FROM "professors" WHERE "professors"."id" = $1  [["id", 1]]
---
  def destroy
    @professor.destroy

INSERT INTO "professors" ("name", "last_name", "overall_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Erick"], ["last_name", "Hernández"], ["overall_score", 0.0], ["created_at", "2015-05-16 06:23:33.750271"], ["updated_at", "2015-05-16 06:23:33.750271"]]
---
  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save

SELECT  "professors".* FROM "professors" WHERE "professors"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_professor
      @professor = Professor.find(params[:id])