app/controllers/schools_controller.rb

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    university = University.find(params[:university_id])