app/views/universities/index.html.haml

SELECT "universities".* FROM "universities"
---
      #universities-section
        - @universities.each do |university|
          .row.university-row
            .col-md-10.col-md-offset-1